Public Member Functions | Static Public Member Functions | List of all members
ACAPI::Impl::v1::FactoryRegistry Class Reference
API Infrastructure
FactoryRegistry own the registered factory. Only one factory can be registered at the same time. Use this to register your mock factory when you're unit testing your code. More...
#include <AbstractFactory.hpp>
 Public Member Functions
FactoryRegistry (const FactoryRegistry &)=delete
FactoryRegistry (FactoryRegistry &&)=delete
void  | RegisterFactory (std::unique_ptr< AbstractFactory > pFactory)
Registers a new factory to the FactoryRegistry. The given factory overrides the previous one.
void  | UnregisterFactory ()
Unregisters the current factory.
bool  | IsFactoryRegistered () const
You can check that there is already a factory registered or not.
const AbstractFactory &  | GetFactory () const
You can get the registered factory.
 Static Public Member Functions
static FactoryRegistry &  | GetInstance ()
You can get the registered factory.
Detailed Description
FactoryRegistry own the registered factory. Only one factory can be registered at the same time. Use this to register your mock factory when you're unit testing your code.
Since
Archicad 28